// ==UserScript==
// @name        去繁留简
// @namespace   https://space.bilibili.com/482343
// @version     2.11.3
// @description 网页上的繁体中文字转为简体。
// @author      古海沉舟
// @include       *
// @exclude *pan.baidu.com*
// @exclude *hdslb.com*
// @exclude *douyin.com*
// @exclude *huya.com*
// @exclude *mihoyo.com*
// @exclude *live.bilibili.com*
// @exclude			*translate.google*
// @exclude			*fanyi.baidu.com*
// @exclude  file://*
// @downloadURL https://update.greasyfork.org/scripts/378243/%E5%8E%BB%E7%B9%81%E7%95%99%E7%AE%80-%E7%B9%81%E7%AE%80%E8%BD%AC%E6%8D%A2.user.js
// @updateURL https://update.greasyfork.org/scripts/378243/%E5%8E%BB%E7%B9%81%E7%95%99%E7%AE%80-%E7%B9%81%E7%AE%80%E8%BD%AC%E6%8D%A2.meta.js
// ==/UserScript==
var chtList='饥宝弦拼说谥扛咨坛骚沈哄干它坛团苏升秋曲千纤辟蔑面蒙蒙蒙霉麻卤累厘历昆昆捆困秸借鉴姜迹合冬雇哄洼袜伪席锈旋咸岩吁扎札钻灶症札才扎汇酸为么鸡线丢乱亚伫来仑侣俣伣侠伥俩仓个们伦伟侧侦伪伧伞备偬传伛债伤倾偻仅佥侨侥偾仪侬亿侩俭傧俦侪偿储俪㑩傩傥俨兑兖内两册幂净冻凛凯别删刭则刹刚剥剐剀创剧刘刽刿剑剂劲动务勋劳势勚劢励劝匀匦匮区协却厍厌厉厣参丛吴呐吕呙员呗吣问哑启唡㖞唤丧乔单哟呛啬唝吗呜唢哔叹喽呕啧尝唛哗唠啸叽哓呒啴嘘㖊哒哝哕嗳哙喷咛吓哜噜啮呖咙亸喾严嘤啭嗫嚣冁呓嘱囱囵国围园圆图团埯垭执坚垩埚尧报场块茔垲埘坞埙尘堑垫坠堕坟垦压垒圹垆垄坜坝壮壶壸寿够梦夹奂奥奁夺奋姹妆姗娱娄妇娅娲妫媪妈妪妩娴婳娆婵娇嫱嫒嬷嫔婴婶娈孙学孪宫寝实审写宽宠宝将专寻对导尴届屉屡层屦属冈岘岛峡崃岗峥岚嵝崭岖嵚崂峤峣峄崄岙嵘屿岿峦巅巯帅师帐带帧帏帼帻帜币帮帱库厕厢厩厦厨厮庙庑废广廪庐厅弑弪张强弹弥弯彦径从徕彻恒耻悦怅闷恶恼恽恻爱惬悫怆恺忾态愠惨惭恸惯怄怂虑悭庆忧惫凭愦惮愤悯怃宪忆恳应怿懔怼懑恹惩懒悬惧慑恋戆戋戗戬战戏户抛捝挟扪扫抡挜挣拣扬换挥损摇捣揾抢掴掼搂挚抠抟掺捞挦撑挠㧑挢掸拨抚揿挞挝捡拥掳择击挡担挤拟摈拧搁掷扩撷摆擞撸摅撵拢拦撄搀撺携摄攒挛摊搅揽败叙敌数敛毙斓斩断时晋昼晕晖旸畅暂晔昙晓暧旷昽书会胧东锨栅栀条枭棁弃枨枣栋栈梾桠杨枫桢业杩荣桤枪椠椁桨桩乐枞楼标枢样树桦桡桥椭横檩柽档桧槚检樯梼槟柠槛橹榈栉椟橼栎橱槠栌枥橥榇蘖栊榉樱栏权椤栾榄棂钦欧欤欢岁归殁残殒殇殚殓殡㱩歼杀壳毁殴毵牦毡氇氢氩氲决没况汹浃泾凉泪渌沦渊涞浅涣减涡测浑凑浈汤沩沟温沧灭涤荥沪滞渗浒浐滚满渔沤汉涟渍涨溆渐浆颍泼潜润浔溃滗涠涩浇涝涧渑泽滪泶浍浊浓湿济涛滥潍滨溅泺滤滢渎㲿泻浏濒泸沥潇潆潴泷濑潋澜沣滠滩灏漤湾滦灾为乌烃无炼炜烟茕焕烦炀煴荧炝热颎炽烨灯烧烫焖营灿烛烩烬焘烁炉烂争爷尔墙牍牵荦犊牺状狭狈狰犹狲狱狮奖独狯猃狝狞猎犷兽獭献猕猡现珐珲玮玚琐瑶莹玛玱琏玑瑷珰环玺琼珑璎瓒瓯产亩毕畴叠痉疴疯疡痪瘗疮疟疭瘘疗痨痫瘅疠瘪疖癞癣瘿瘾痈瘫癫皑疱皲皱盗盏监盘卢眦众睁睐䁖瞒瞆睑眬瞩矫硁硖砗砚硕砀码硙砖碜碛矶硗础碍矿砺砾矾砻禄祸祯祎祃禅礼祢祷秃籼税秆禀称稣积颖秾穑秽稳稆窝穷窑窎窭窥窜窍窦窃竞笔笋笕䇲笺筝节箧筼笃筛筚箦篓箪简篑箫筜签篮筹箓箨籁笼笾簖箩粤糁粪粮粝籴粜纠纪纣约红纡纥纨纫纹纳纽纾纯纰纼纱纮纸级纷纭纴纺䌷细绂绁绅纻绍绀绋绐绌终组䌹绊绗结绝绦绞络绚给绒绖统丝绛绢绑绡绠绨绤绥经综缍绿绸绻绶维绹绾纲缀䌽纶绺绮绽绰绫绵绲缁紧绯绪缃缄缂线缉缎缔缗缘缌编缓缅纬缑缈练缏缇萦缙缢缒绉缣缊缞缚缜缟缛县缝缡缩纵缧䌸缦絷缕缥总绩绷缫缪缯织缮缭绕绣缋绳绘缳缲缴䍁绎继缤缱缬纩续缠缨纤缵缆钵罂罚骂罢罗罴羁芈羟义习翘耧闻联聪声耸聩聂职聍聋肃胁脉胫脱胀肾脶脑肿脚肠腽肤胶腻胆脍脓脸脐膑胪脔臜临兴举旧舱舣舰舻艰艳刍苎兹荆茎荚苋华苌莱莴叶荭苇荤莳莅苍荪盖莲苁莼荜蒌蒋葱茑荫荨蒇荞莸荛蒉芜萧蓣蕰荟蓟芗蔷荙莶萨䓕荠蓝荩艺薮苈蔼蔺蕲芦苏蕴藓蔹茏兰蓠萝处虚虏号亏虬蛱蜕蚬蚀猬虾蜗蛳蚂萤䗖蝼螀蛰蝈蝉蛲蛏蚁蝇虿蛴蝾蛎蟏蛊蛮术卫衮袅补装裈袆裤裢褛亵袯袄裣裆褴袜䙓衬袭见规觅视觇觋觎亲觊觏觐觑觉览觌观觞觯订讣计讯讧讨讦讱训讪讫讬记讹讶讼䜣诀讷访设许诉诃诊诂诋讵诈诒诏评诐诇诎诅词咏诩询诣试诗诧诟诡诠诘话该详诜诙诖诔诛诓认诳诶诞诱诮语诚诫诬误诰诵诲说谁课谇诽谊訚调谄谆谈诿请诤诹诼谅论谂谀谍谞谝诨谔谛谐谏谕谘讳谙谌讽诸谚谖诺谋谒谓誊诌谎谜谧谑谡谤谦谥讲谢谣谟谪谬讴谨谩䜧证谲讥谮识谯谭谱谵译议谴护诪誉谫读变雠谗让谰谶谠谳岂竖猪豮猫䝙贝贞负财贡贫货贩贪贯责贮贳赀贰贵贬买贷贶费贴贻贸贺贲赂赁贿赅资贾贼赈赊宾赇赒赉赐赏赔赓贤卖贱赋赕质账赌䞐赖赗赚赙购赛赜贽赘赟赠赞赡赢赆赃赑赎赝赣赪赵趋趱迹践跄跸蹒踪跷跶趸踌跻跃踯跞踬蹰跹蹑蹿躜躏躯车轧轨军轪轩轫轭软轸轴轵轺轲轶轼较辂辁辀载轾辄辅轻辆辎辉辋辍辊辇辈轮辌辑辏输辐辗舆辒毂辖辕辘转辙轿辚轰辔轹轳办辞辫辩农迳这连进运过达违遥逊递远迟迁选遗辽迈还迩边逻逦郏邮郓乡邹邬郧邓郑邻郸邺郐邝酂郦酝医酱酦酿衅酾酽释钆钇钌钊钉钋针钓钐钏钒钗钍钕钯钫钘钭钠钝钤钣钑钞钮钧钙钬钛钪铌铈钶铃钴钹铍钰钸铀钿钾钜铊铉铇铋铂钳铆铅钺钩钲钼钽铏铰铒铬铪银铳铜铚铣铨铢铭铫铦衔铑铷铱铟铵铥铕铯铐锐销锑锉铝锒锌钡铤铗锋铻锊锓锄锔锇铓铺铖锆锂铽锯钢锞录锖锩铔锥锕锟锱铮锛锬锭锜钱锦锚锠锡锢错锰铼钔锴锅镀锷铡钖锻锽锸锲锹锾键锶锗镁镑镕锁镉镈镃钨蓥镏铠铩锼镐镇镒镋镍镓镞镟链镆镙镠镝铿锵镗镘镛铲镜镖镂錾铧镤镪锈铙铴镣铹镦镡镫镨镄镌镰镯镭铁镮铎铛镱铸镬镔鉴锧镴铄镳镧钥镵镶镊锣钻銮凿镢长门闩闪闫闬闭开闶闳闰闲间闵闸阂阁阀闺闽阃阆闾阅阊阉阎阏阍阈阌阒闱阔阕阑阇阗阘闿阖阙闯关阚阓阐阛闼坂陉陕阵阴陈陆阳陧队阶陨际随险隐陇隶隽虽双雏杂鸡难电霡雾霁雳霭灵靓静靥鼗巩绱缰鞑鞯韦韧韨韩韪韬韫韵响页顶顷项顺顸顼颂颀颃预顽颁顿颇领颌颉颐颏头颊颋颔颈颓频颗题额颚颜颙颛颡颠类颟颢顾颤显颦颅颞颧风飐飑飒飓飔飏飖飕飗飘飙飞饤饦饨饪饫饬饭饮饴饲饱饰饺饼饷养饵饽馁饿馂饾馄饯馅馆糇饧馎饩馏馊馌馍馒馐馑馈馔饶飨餍馋马驭冯驮驰驯驲驳驻驽驹驵驾骀驸驶驼驷骈骇骃骆骎骏骋骍骓骒骑骐骛骗骙䯄骞骘骝腾驺骚骟骡蓦骜骖骠骢驱骅骕骁骣骄验驿骤驴骧骥骦骊骉髅髌髋鬓闹阋阄魉魇鱼鱽鲀鲁鲂鱿鲄鲐鲍鲋鲊鲒鲕鲖鲔鲛鲑鲜鲪鲧鲠鲩鲤鲨鲻鲯鲭鲞鲷鲱鲵鲲鲳鲸鲮鲰鳀鲫鲽鳇鳅鳆鳃鳒鲥鳏鳎鳐鳍鲢鳌鳓鲦鲣鳗鳛鳔鳕鳖鳟鳝鳜鳞鲟鲎鲙鳣鳢鲿鲚鳄鲈鲡鸟凫鸠鸤凤鸣鸢鸩鸨鸦鸰鸵鸳鸲鸮鸱鸪鸯鸭鸸鸹䴕鸿鸽䴔鸺鸼鹃鹆鹁鹈鹅鹄鹉鹌鹏鹎鹊鹓䴖鸫鹑鹒鹙鹕鹗鹖鹜䴗鸧莺鹟鹤鹠鹡鹘鹣鹚鹢鹞䴘鹝鹧鹥鸥鸷鹨鸶鹪鹔鹩鹫鹇鹬鹰鹭鸴䴙㶉鹯鹲鸬鹦鹳鹂鸾鹾盐丽麦麸黄黉点黪黡黩黾鼋鼍鼹齐斋赍齑齿龀龁龂龅龇龃龆龄龈龊龉龋腭龌龙庞龚龛龟汇坛历冲获当尽脏药荡锤须饥卤发药㟆㨫䌾䞍䯅鲃䲝鳚俫刬㓥㔉咝垱垅屃岽悮㧟枧榅滟㶽㶶犸㺍痖疬眍砜硷纟绔绬䍀耢胨荮荬螨裥觍讻贠轷轱钎钚钷铞铘锃锍锫锝锪锳锘锿镅镎镚锎锏镲镥镩鞒颒颕颥飚饣饹馃馇馓馕骔鲅鲆鲉鲏鲇鲴鲺鳊鲗鳑鳋鳘鲹鳙鲼鸻鹀鹐鹍鹋鹛鹱鹴厐䌺垴讠钅䌶戯梿㱮瘆䅉䌼觃饳饸饻馉鱾鲌鲘鲓鲝鲬鳈鳂鲾鳁鳉鳡鳠䴓杰佣仆价优儿划胜吨涂坏奸宁尸岭几厂后征怜怀忏舍挂扑据扰于晒杆栖极构朴机柜气洁淀泞洒炖异痒确御种洼范筑帘篱网茧圣听腊与庄万荐苹虮虫蜡蚕制触注夸丰赶踊挽适丑离云愿刮肴惊肮体松斗郁咸么党采并系干复只里渖画钟钟䩄余鲶碱岁雕冲凶恶发哟为么复卜准啰欲艳脏赞颂叹游周闲致托愈昵志喂台杠台痴铺板里你一觉龟发炮肉圆启回卷看他啰湿钟涌炼硅烟签荡出啮霉夫占局咱尽凄克铲勋恤念吃向咽冢硗埙奶屃仑岳别雕彷栗殷慑戚欢一净尝胯布膻泛弥系伙胡击咳杯余晒苏诶须泄姐钵背台历';
var chsList='饥宝弦拼说谥扛咨坛骚沈哄干它坛团苏升秋曲千纤辟蔑面蒙蒙蒙霉麻卤累厘历昆昆捆困秸借鉴姜迹合冬雇哄洼袜伪席锈旋咸岩吁扎札钻灶症札才扎汇酸为么鸡线丢乱亚伫来仑侣俣伣侠伥俩仓个们伦伟侧侦伪伧伞备偬传伛债伤倾偻仅佥侨侥偾仪侬亿侩俭傧俦侪偿储俪㑩傩傥俨兑兖内两册幂净冻凛凯别删刭则刹刚剥剐剀创剧刘刽刿剑剂劲动务勋劳势勚劢励劝匀匦匮区协却厍厌厉厣参丛吴呐吕呙员呗吣问哑启唡㖞唤丧乔单哟呛啬唝吗呜唢哔叹喽呕啧尝唛哗唠啸叽哓呒啴嘘㖊哒哝哕嗳哙喷咛吓哜噜啮呖咙亸喾严嘤啭嗫嚣冁呓嘱囱囵国围园圆图团埯垭执坚垩埚尧报场块茔垲埘坞埙尘堑垫坠堕坟垦压垒圹垆垄坜坝壮壶壸寿够梦夹奂奥奁夺奋姹妆姗娱娄妇娅娲妫媪妈妪妩娴婳娆婵娇嫱嫒嬷嫔婴婶娈孙学孪宫寝实审写宽宠宝将专寻对导尴届屉屡层屦属冈岘岛峡崃岗峥岚嵝崭岖嵚崂峤峣峄崄岙嵘屿岿峦巅巯帅师帐带帧帏帼帻帜币帮帱库厕厢厩厦厨厮庙庑废广廪庐厅弑弪张强弹弥弯彦径从徕彻恒耻悦怅闷恶恼恽恻爱惬悫怆恺忾态愠惨惭恸惯怄怂虑悭庆忧惫凭愦惮愤悯怃宪忆恳应怿懔怼懑恹惩懒悬惧慑恋戆戋戗戬战戏户抛捝挟扪扫抡挜挣拣扬换挥损摇捣揾抢掴掼搂挚抠抟掺捞挦撑挠㧑挢掸拨抚揿挞挝捡拥掳择击挡担挤拟摈拧搁掷扩撷摆擞撸摅撵拢拦撄搀撺携摄攒挛摊搅揽败叙敌数敛毙斓斩断时晋昼晕晖旸畅暂晔昙晓暧旷昽书会胧东锨栅栀条枭棁弃枨枣栋栈梾桠杨枫桢业杩荣桤枪椠椁桨桩乐枞楼标枢样树桦桡桥椭横檩柽档桧槚检樯梼槟柠槛橹榈栉椟橼栎橱槠栌枥橥榇蘖栊榉樱栏权椤栾榄棂钦欧欤欢岁归殁残殒殇殚殓殡㱩歼杀壳毁殴毵牦毡氇氢氩氲决没况汹浃泾凉泪渌沦渊涞浅涣减涡测浑凑浈汤沩沟温沧灭涤荥沪滞渗浒浐滚满渔沤汉涟渍涨溆渐浆颍泼潜润浔溃滗涠涩浇涝涧渑泽滪泶浍浊浓湿济涛滥潍滨溅泺滤滢渎㲿泻浏濒泸沥潇潆潴泷濑潋澜沣滠滩灏漤湾滦灾为乌烃无炼炜烟茕焕烦炀煴荧炝热颎炽烨灯烧烫焖营灿烛烩烬焘烁炉烂争爷尔墙牍牵荦犊牺状狭狈狰犹狲狱狮奖独狯猃狝狞猎犷兽獭献猕猡现珐珲玮玚琐瑶莹玛玱琏玑瑷珰环玺琼珑璎瓒瓯产亩毕畴叠痉疴疯疡痪瘗疮疟疭瘘疗痨痫瘅疠瘪疖癞癣瘿瘾痈瘫癫皑疱皲皱盗盏监盘卢眦众睁睐䁖瞒瞆睑眬瞩矫硁硖砗砚硕砀码硙砖碜碛矶硗础碍矿砺砾矾砻禄祸祯祎祃禅礼祢祷秃籼税秆禀称稣积颖秾穑秽稳稆窝穷窑窎窭窥窜窍窦窃竞笔笋笕䇲笺筝节箧筼笃筛筚箦篓箪简篑箫筜签篮筹箓箨籁笼笾簖箩粤糁粪粮粝籴粜纠纪纣约红纡纥纨纫纹纳纽纾纯纰纼纱纮纸级纷纭纴纺䌷细绂绁绅纻绍绀绋绐绌终组䌹绊绗结绝绦绞络绚给绒绖统丝绛绢绑绡绠绨绤绥经综缍绿绸绻绶维绹绾纲缀䌽纶绺绮绽绰绫绵绲缁紧绯绪缃缄缂线缉缎缔缗缘缌编缓缅纬缑缈练缏缇萦缙缢缒绉缣缊缞缚缜缟缛县缝缡缩纵缧䌸缦絷缕缥总绩绷缫缪缯织缮缭绕绣缋绳绘缳缲缴䍁绎继缤缱缬纩续缠缨纤缵缆钵罂罚骂罢罗罴羁芈羟义习翘耧闻联聪声耸聩聂职聍聋肃胁脉胫脱胀肾脶脑肿脚肠腽肤胶腻胆脍脓脸脐膑胪脔臜临兴举旧舱舣舰舻艰艳刍苎兹荆茎荚苋华苌莱莴叶荭苇荤莳莅苍荪盖莲苁莼荜蒌蒋葱茑荫荨蒇荞莸荛蒉芜萧蓣蕰荟蓟芗蔷荙莶萨䓕荠蓝荩艺薮苈蔼蔺蕲芦苏蕴藓蔹茏兰蓠萝处虚虏号亏虬蛱蜕蚬蚀猬虾蜗蛳蚂萤䗖蝼螀蛰蝈蝉蛲蛏蚁蝇虿蛴蝾蛎蟏蛊蛮术卫衮袅补装裈袆裤裢褛亵袯袄裣裆褴袜䙓衬袭见规觅视觇觋觎亲觊觏觐觑觉览觌观觞觯订讣计讯讧讨讦讱训讪讫托记讹讶讼䜣诀讷访设许诉诃诊诂诋讵诈诒诏评诐诇诎诅词咏诩询诣试诗诧诟诡诠诘话该详诜诙诖诔诛诓认诳诶诞诱诮语诚诫诬误诰诵诲说谁课谇诽谊訚调谄谆谈诿请诤诹诼谅论谂谀谍谞谝诨谔谛谐谏谕咨讳谙谌讽诸谚谖诺谋谒谓誊诌谎谜谧谑谡谤谦谥讲谢谣谟谪谬讴谨谩䜧证谲讥谮识谯谭谱谵译议谴护诪誉谫读变雠谗让谰谶谠谳岂竖猪豮猫䝙贝贞负财贡贫货贩贪贯责贮贳赀贰贵贬买贷贶费贴贻贸贺贲赂赁贿赅资贾贼赈赊宾赇赒赉赐赏赔赓贤卖贱赋赕质账赌䞐赖赗赚赙购赛赜贽赘赟赠赞赡赢赆赃赑赎赝赣赪赵趋趱迹践跄跸蹒踪跷跶趸踌跻跃踯跞踬蹰跹蹑蹿躜躏躯车轧轨军轪轩轫轭软轸轴轵轺轲轶轼较辂辁辀载轾辄辅轻辆辎辉辋辍辊辇辈轮辌辑辏输辐辗舆辒毂辖辕辘转辙轿辚轰辔轹轳办辞辫辩农迳这连进运过达违遥逊递远迟迁选遗辽迈还迩边逻逦郏邮郓乡邹邬郧邓郑邻郸邺郐邝酂郦酝医酱酦酿衅酾酽释钆钇钌钊钉钋针钓钐钏钒钗钍钕钯钫钘钭钠钝钤钣钑钞钮钧钙钬钛钪铌铈钶铃钴钹铍钰钸铀钿钾钜铊铉铇铋铂钳铆铅钺钩钲钼钽铏铰铒铬铪银铳铜铚铣铨铢铭铫铦衔铑铷铱铟铵铥铕铯铐锐销锑锉铝锒锌钡铤铗锋铻锊锓锄锔锇铓铺铖锆锂铽锯钢锞录锖锩铔锥锕锟锱铮锛锬锭锜钱锦锚锠锡锢错锰铼钔锴锅镀锷铡钖锻锽锸锲锹锾键锶锗镁镑镕锁镉镈镃钨蓥镏铠铩锼镐镇镒镋镍镓镞旋链镆镙镠镝铿锵镗镘镛铲镜镖镂錾铧镤镪锈铙铴镣铹镦镡镫镨镄镌镰镯镭铁镮铎铛镱铸镬镔鉴锧镴铄镳镧钥镵镶镊锣钻銮凿镢长门闩闪闫闬闭开闶闳闰闲间闵闸阂阁阀闺闽阃阆闾阅阊阉阎阏阍阈阌阒闱阔阕阑阇阗阘闿阖阙闯关阚阓阐阛闼坂陉陕阵阴陈陆阳陧队阶陨际随险隐陇隶隽虽双雏杂鸡难电霡雾霁雳霭灵靓静靥鼗巩绱缰鞑鞯韦韧韨韩韪韬韫韵响页顶顷项顺顸顼颂颀颃预顽颁顿颇领颌颉颐颏头颊颋颔颈颓频颗题额颚颜颙颛颡颠类颟颢顾颤显颦颅颞颧风飐飑飒飓飔飏飖飕飗飘飙飞饤饦饨饪饫饬饭饮饴饲饱饰饺饼饷养饵饽馁饿馂饾馄饯馅馆糇饧馎饩馏馊馌馍馒馐馑馈馔饶飨餍馋马驭冯驮驰驯驲驳驻驽驹驵驾骀驸驶驼驷骈骇骃骆骎骏骋骍骓骒骑骐骛骗骙䯄骞骘骝腾驺骚骟骡蓦骜骖骠骢驱骅骕骁骣骄验驿骤驴骧骥骦骊骉髅髌髋鬓闹阋阄魉魇鱼鱽鲀鲁鲂鱿鲄鲐鲍鲋鲊鲒鲕鲖鲔鲛鲑鲜鲪鲧鲠鲩鲤鲨鲻鲯鲭鲞鲷鲱鲵鲲鲳鲸鲮鲰鳀鲫鲽鳇鳅鳆鳃鳒鲥鳏鳎鳐鳍鲢鳌鳓鲦鲣鳗鳛鳔鳕鳖鳟鳝鳜鳞鲟鲎鲙鳣鳢鲿鲚鳄鲈鲡鸟凫鸠鸤凤鸣鸢鸩鸨鸦鸰鸵鸳鸲鸮鸱鸪鸯鸭鸸鸹䴕鸿鸽䴔鸺鸼鹃鹆鹁鹈鹅鹄鹉鹌鹏鹎鹊鹓䴖鸫鹑鹒鹙鹕鹗鹖鹜䴗鸧莺鹟鹤鹠鹡鹘鹣鹚鹢鹞䴘鹝鹧鹥鸥鸷鹨鸶鹪鹔鹩鹫鹇鹬鹰鹭鸴䴙㶉鹯鹲鸬鹦鹳鹂鸾鹾盐丽麦麸黄黉点黪黡黩黾鼋鼍鼹齐斋赍齑齿龀龁龂龅龇龃龆龄龈龊龉龋腭龌龙庞龚龛龟汇坛历冲获当尽脏药荡锤须饥卤发药㟆㨫䌾䞍䯅鲃䲝鳚俫刬㓥㔉咝垱垅屃岽悮㧟枧榅滟㶽㶶犸㺍痖疬眍砜硷纟绔绬䍀耢胨荮荬螨裥觍讻贠轷轱钎钚钷铞铘锃锍锫锝锪锳锘锿镅镎镚锎锏镲镥镩鞒颒颕颥飚饣饹馃馇馓馕骔鲅鲆鲉鲏鲇鲴鲺鳊鲗鳑鳋鳘鲹鳙鲼鸻鹀鹐鹍鹋鹛鹱鹴厐䌺垴讠钅䌶戯梿㱮瘆䅉䌼觃饳饸饻馉鱾鲌鲘鲓鲝鲬鳈鳂鲾鳁鳉鳡鳠䴓杰佣仆价优儿划胜吨涂坏奸宁尸岭几厂后征怜怀忏舍挂扑据扰于晒杆栖极构朴机柜气洁淀泞洒炖异痒确御种洼范筑帘篱网茧圣听腊与庄万荐苹虮虫蜡蚕制触注夸丰赶踊挽适丑离云愿刮肴惊肮体松斗郁咸么党采并系干复只里沈画钟钟䩄余鲶碱岁雕冲凶恶发哟为么复卜准啰欲艳脏赞颂叹游周闲致托愈昵志喂台杠台痴铺板里你一觉龟发炮肉圆启回卷看他啰湿钟涌炼硅烟签荡出啮霉夫占局咱尽凄克铲勋恤念吃向咽冢硗埙奶屃仑岳别雕彷栗殷慑戚欢一净尝胯布膻泛弥系伙胡击咳杯余晒苏诶须泄姐钵背台历';
var bf;
function handleTextNode(pNode){
    var childs;
    if(pNode){
        childs=pNode.childNodes;
    }else{
        childs=document.documentElement.childNodes;
    }
    if(childs){
        for(var i=0;i<childs.length;i++){
            var child=childs.item(i);
            //if(/SCRIPT|HR|TEXTAREA/.test(child.tagName))continue;
            if(child.title){
                let title=conv(child.title);
                if(child.title != title){
                    child.title=title;
                }
            }
            if(child.alt){
                let alt=conv(child.alt);
                if(child.alt != alt){
                    child.alt=alt;
                }
            }
            if(child.tagName == "INPUT" && child.value !== "" && child.type != "text" && child.type != "search" && child.type != "hidden"){
                let value=conv(child.value);
                if(child.value != value){
                    child.value=value;
                }
            }else if(child.nodeType == 3){
                let data=conv(child.data);
                if(child.data != data){
                    child.data=data;
                }
            }else handleTextNode(child);
        }
    }
}

function conv(str){
    if(!str)return "";
    var ret='', index, cha,l=str.length;
    for(var i=0;i<str.length;i++){
        cha=str.charAt(i);
        if(cha.charCodeAt(0) > 1000){
            index=chtList.indexOf(cha);
            if(index != -1) {ret+=chsList.charAt(index);}
            else{
                switch(str.charAt(i))
                {
                    case "乾":
                        cha = "乾";
                        if ( i+1<l ) {if (str.charAt(i+1) == "乾" && str.charAt(i+2) == "净" ) {cha = "干";}}
                        var j = i + 1;
                        if ( j < l ) {
                            if ( str.charAt(j) == "爹" ||str.charAt(j) == "爸" ||str.charAt(j) == "妈" ||str.charAt(j) == "娘" ||str.charAt(j) == "脆" ||str.charAt(j) == "净" ||str.charAt(j) == "净" || str.charAt(j) == "燥" || str.charAt(j) == "糙" || str.charAt(j) == "旱"|| str.charAt(j) == "枯" || str.charAt(j) == "柴"|| str.charAt(j) == "竭") {cha = "干";}
                        }
                        j = i - 1;
                        if ( i > 0 ) {if ( str.charAt(j) == "饼" || str.charAt(j) == "腐" ) {cha = "干";}}
                        break;
                    case "は":
                        cha = "无";
                        j = i + 1;
                        if ( j < l ) {if ( str.charAt(j) != "套" ) {cha = "は";}}
                        break;
                    case "着":
                        cha = "着";
                        j = i + 1;
                        if ( j < l ) {
                            if ( str.charAt(j) == "乎" || str.charAt(j) == "作" || str.charAt(j) == "名") {cha = "着";}
                        }
                        j = i - 1;
                        if ( i > 0 ) {
                            if ( str.charAt(j) == "于" || str.charAt(j) == "名" || str.charAt(j) == "原" || str.charAt(j) == "专") {cha = "着";}
                        }
                        break;
                    default:
                        break;
                }
                ret+=cha;
            }
        }
        else ret+=cha;
    }
    return ret;
}

const progress = function(){
    var lhref=window.location.href;
    setTimeout(function(){

    bf=document.body;
    handleTextNode(bf);
    document.body=bf;

        var MutationObserver = window.MutationObserver || window.WebKitMutationObserver || window.MozMutationObserver;
        var observer = new MutationObserver(function(records){
            records.map(function(record) {
                if(record.addedNodes){
                    [].forEach.call(record.addedNodes,function(item){
                        handleTextNode(item);
                    });
                }
            });
        });
        var option = {
            'childList': true,
            'characterData':true,
            'subtree': true
        };
        observer.observe(document.body, option);
        setInterval(function(){
            if (lhref!=window.location.href){
                lhref=window.location.href;
                setTimeout(function(){
    bf=document.body;
    handleTextNode(bf);
    document.body=bf;
                },2000);
            }
        },1000);
        if (window.location.href.indexOf("youtube")>-1) {
            setTimeout(function(){
    bf=document.body;
    handleTextNode(bf);
    document.body=bf;
            },1000);// 刷新延迟 2000 毫秒
        }

        if (document.hidden !== undefined) {
            document.addEventListener('visibilitychange', () => {
                //console.log(document.hidden);
                if(document.hidden != true){
                    setTimeout(function(){
    bf=document.body;
    handleTextNode(bf);
    document.body=bf;
                    },1000);
                }
            })
        }
    },1000);
}
window.addEventListener('load', progress, false);
